Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортЛимитныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ИмпортЛимитныхВедомостей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураТаблиц</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортЛимитныхВедомостей/Forms/Форма/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеСведения.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""ИнвестиционныеДекларации.ИмяФайлаЛимитнойВедомости""";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтаФорма.ДопСведение = Выборка.Ссылка;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено доп. сведение по ключу ""ИнвестиционныеДекларации.ИмяФайлаЛимитнойВедомости"""); 
	КонецЕсли;
	
	Элементы.ДанныеИД.Видимость = Ложь;
	
	ЕстьПравоНаИзменениеИД = ПравоДоступа("Изменение", Метаданные.Справочники.ИнвестиционныеДекларации);
	Элементы.ФайлыКомандаСоздатьИНазначить.Доступность = ЕстьПравоНаИзменениеИД;
	
	Если РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
		Элементы.ДанныеИДКомандаВыгрузитьВЕГАР.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Каталог) Тогда
		КомандаПрочитатьФайлы(Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура КаталогПриИзменении(Элемент)
	КомандаПрочитатьФайлы(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтаФорма.Каталог = ДиалогВыбора.Каталог;
	КомандаПрочитатьФайлы(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	СтрокаТаблицыФайлы = Элементы.Файлы.ТекущиеДанные;
	Если СтрокаТаблицыФайлы <> Неопределено Тогда
	
		Если СтрокаТаблицыФайлы.СодержитОшибки Тогда
			Элементы.ОшибкиФайла.Видимость = Истина;
			Элементы.ДанныеИД.Видимость = Ложь;
			ЗаполнитьТаблицуОшибокПоФайлу(СтрокаТаблицыФайлы.ИмяФайла);
		Иначе
			Элементы.ОшибкиФайла.Видимость = Ложь;
			Элементы.ДанныеИД.Видимость = Истина;			
		КонецЕсли; 		
	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ФайлыНазначениеИнвестиционнойДекларации" Тогда
		
		СтрокаТаблицыФайлов = ЭтаФорма.Файлы.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		Если ЗначениеЗаполнено(СтрокаТаблицыФайлов.НазначениеИнвестиционнойДекларации) Тогда
			ОткрытьФорму("Документ.НазначениеИнвестиционнойДекларации.Форма.ФормаДокумента", Новый Структура("Ключ", СтрокаТаблицыФайлов.НазначениеИнвестиционнойДекларации));
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиФайлаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОшибкиФайлаДействие" Тогда
		
		ТекСтрока = ЭтаФорма.ОшибкиФайла.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ТекСтрока.Действие = "Создать набор" Тогда
			
			ЗначенияЗаполнения = Новый Структура("НаборДанных, ЭтоГруппа, Отбор", "Основной", Ложь, ТекСтрока.Отбор);
			ОткрытьФормуМодально("Справочник.НаборыИнвестиционныхДеклараций.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
			ЗаполнитьНаборыПоХэшСуммеНаСервере(ВыбраннаяСтрока);
			
		ИначеЕсли ТекСтрока.Действие = "Импортировать" Тогда
			
			ПараметрыИмпорта = Новый Структура;
			ПараметрыИмпорта.Вставить("ГруппаПравил",						"Матрих");
			ПараметрыИмпорта.Вставить("ГруппаОбъектов",						ТекСтрока.Группа);
			ПараметрыИмпорта.Вставить("ЗакрытьФормуПослеУспешногоИмпорта",	Истина);
			ПараметрыИмпорта.Вставить("ОбновитьПриОткрытии",				Истина);
			
			Форма = ПолучитьФорму("Обработка.ИмпортНормативноСправочнойИнформации.Форма", ПараметрыИмпорта);
			Форма.СтрокаПоиска = ТекСтрока.СтрокаПоиска;
			ОбработанныеОбъекты = Форма.ОткрытьМодально();
			
			Если ОбработанныеОбъекты <> Неопределено И ОбработанныеОбъекты.Количество() = 1 Тогда
				// обновим статусы ошибок
				СтрокиОшибок = ЭтаФорма.Ошибки.НайтиСтроки(Новый Структура("ОписаниеОшибки", ТекСтрока.ОписаниеОшибки));
				Для каждого Строка Из СтрокиОшибок Цикл
					ЭтаФорма.Ошибки.Удалить(Строка);
				КонецЦикла; 
				ЭтаФорма.ОшибкиФайла.Удалить(ТекСтрока);
			
			КонецЕсли; 
			
		КонецЕсли; 
		
		ОбновитьСтатусыОшибокФайлов();
		ФайлыПриАктивизацииСтроки(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаПрочитатьФайлы(Команда)
	
	ФайлыДляОбработки = РаботаСФайламиКлиентСервер.ПолучитьФайлыДляОбработкиИзКаталога(ЭтаФорма.Каталог, "*.xml", Ложь);
	
	Если ФайлыДляОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого РеквизитыФайла Из ФайлыДляОбработки Цикл
	
		Если РеквизитыФайла.Файл.Существует() Тогда
			РеквизитыФайла.Вставить("ИмяФайла", РеквизитыФайла.Файл.Имя);
			РеквизитыФайла.Вставить("ПолноеИмяФайла", РеквизитыФайла.Файл.ПолноеИмя);
			РеквизитыФайла.Вставить("ДвоичныеДанные", Новый ДвоичныеДанные(РеквизитыФайла.Файл.ПолноеИмя));
			РеквизитыФайла.Вставить("ДатаСоздания", РеквизитыФайла.Файл.ПолучитьВремяИзменения());
			РеквизитыФайла.Удалить("Файл");
		КонецЕсли;
	
	КонецЦикла;
	
	Если ФайлыДляОбработки.Количество() > 0 Тогда
	
		АдресДанных = ПоместитьВоВременноеХранилище(ФайлыДляОбработки, ЭтаФорма.УникальныйИдентификатор);
		КомандаПрочитатьФайлыНаСервере(АдресДанных);
		УдалитьИзВременногоХранилища(АдресДанных);
		
	Иначе 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В заданом каталоге нет файлов с лимитными ведомостями!",,, "Каталог"); 
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьИНазначить(Команда)
	
	Для каждого СтрокаТаблицыФайлы Из ЭтаФорма.Файлы Цикл
	
		Если СтрокаТаблицыФайлы.Загрузить И Не СтрокаТаблицыФайлы.СодержитОшибки Тогда
		
			Ссылка = СоздатьИНазначитьЛимитныеВедомости(СтрокаТаблицыФайлы.ПолучитьИдентификатор());
			
			Если ЗначениеЗаполнено(Ссылка) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведен документ " + Ссылка, Ссылка);
			КонецЕсли;			
		
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьВЕГАР(Команда)
	
	ДанныеФайла = Элементы.Файлы.ТекущиеДанные;
	ДанныеТекущейИД = Элементы.ДанныеИД.ТекущиеДанные;
	
	Если ДанныеФайла = Неопределено Или ДанныеТекущейИД = Неопределено Тогда
		Предупреждение("Сначала необходимо выделить файл и группу договоров для выгрузки");
	Иначе
		ПараметрыФормы = ПараметрыВыгрузкиВЕГАР(ДанныеФайла.ПолучитьИдентификатор(), ДанныеТекущейИД.Представление);
		ОткрытьФормуМодально("ВнешняяОбработка._ИмпортЛимитныхВедомостей.Форма.ВыгрузкаВЕГАР", Новый Структура("АдресПараметров", ПараметрыФормы));
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	ИзменитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	ИзменитьФлажки(Ложь);
КонецПроцедуры

#КонецОбласти 

#Область Выгрузка_в_Excel

&НаКлиенте
Процедура КомандаВыгрузитьВExcel(Команда)
	
	ДатаАктуальностиДанных = ТекущаяДата();
	
	Если ВвестиДату(ДатаАктуальностиДанных, "Дата актуальности ЛВ", ЧастиДаты.Дата) Тогда
	
		Результат = ПодготовитьДанныеДляВыгрузкиВExcel(ДатаАктуальностиДанных);
		
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла     = Результат.Заголовок;
		ДиалогСохраненияФайла.Фильтр             = "Книга Excel 2007 (*.xlsx)|*.xlsx";
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		
		Если ДиалогСохраненияФайла.Выбрать() Тогда
			Попытка
				Результат.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
			Исключение
				Предупреждение(ОписаниеОшибки());
			КонецПопытки; 
		КонецЕсли;		
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляВыгрузкиВExcel(ДатаАктуальностиДанных)
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Отбор = Новый Структура("Организация", Объект.Организация);
	
	Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(Запрос, ДатаАктуальностиДанных, Отбор);
	
	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииСрезПоследних.НазначениеИнвестиционнойДекларации КАК НазначениеИнвестиционнойДекларации,
		|	ДокументНазначение.Дата КАК Дата
		|ПОМЕСТИТЬ _Назначения
		|ИЗ
		|	РегистрСведений.ИнвестиционныеДекларации.СрезПоследних(
		|			&Период,
		|			(Организация, Субъект, ТипИнвестиционнойДекларации) В
		|				(ВЫБРАТЬ
		|					&Организация,
		|					ДействующиеСчетаДУ.Клиент,
		|					ЗНАЧЕНИЕ(Перечисление.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость)
		|				ИЗ
		|					ДействующиеСчетаДУ КАК ДействующиеСчетаДУ)) КАК ИнвестиционныеДекларацииСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации КАК ДокументНазначение
		|		ПО ИнвестиционныеДекларацииСрезПоследних.НазначениеИнвестиционнойДекларации = ДокументНазначение.Ссылка
		|ГДЕ
		|	ИнвестиционныеДекларацииСрезПоследних.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Назначения.НазначениеИнвестиционнойДекларации КАК Ссылка,
		|	_Назначения.Дата КАК ДатаСоздания,
		|	ЗначенияДополнительныхСведений.Значение КАК ИмяФайла
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ЗначенияДополнительныхСведений.Свойство = ДополнительныеСведения.Ссылка
		|			И (ДополнительныеСведения.Ключ = ""ИнвестиционныеДекларации.ИмяФайлаЛимитнойВедомости"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Назначения КАК _Назначения
		|		ПО ЗначенияДополнительныхСведений.Объект = _Назначения.НазначениеИнвестиционнойДекларации";		
	#КонецОбласти 
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", ДатаАктуальностиДанных);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ФайлыДляОбработки = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеФайла = ПолучитьДанныеФайлаИзДокументооборота(Выборка);
		Если ТипЗнч(ДанныеФайла) = Тип("Структура") Тогда
			ФайлыДляОбработки.Добавить(ДанныеФайла);
		КонецЕсли;		
		
	КонецЦикла;	 
	
	СтруктураТаблиц = ОбъектНаСервере.ПрочитатьФайлы(ФайлыДляОбработки, Ложь);
	Макет = ОбъектНаСервере.ПолучитьМакет("МакетExcel");
	
	Возврат ОбработатьДанные(СтруктураТаблиц, ДатаАктуальностиДанных, Макет);
			
КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьДанные(СтруктураТаблиц, Период, Макет)

	ГруппыДоговоров = Новый ТаблицаЗначений;
	ГруппыДоговоров.Колонки.Добавить("ИмяФайла", 		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255)));
	ГруппыДоговоров.Колонки.Добавить("ДатаЛВ", 			Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ГруппыДоговоров.Колонки.Добавить("Клиент", 			Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	ГруппыДоговоров.Колонки.Добавить("ВидДоговора", 	Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровДоверительногоУправления"));
	ГруппыДоговоров.Колонки.Добавить("ИмяГруппы", 		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(1000)));
	ГруппыДоговоров.Колонки.Добавить("НомерДоговора", 	Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(70)));
	ГруппыДоговоров.Колонки.Добавить("КодСчета", 		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	ГруппыДоговоров.Колонки.Добавить("СчетДоверительногоУправления", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	
	МассивФайлов = Новый Массив;
	
	Для каждого СтрокаФайл Из СтруктураТаблиц.Файлы Цикл
	
		Если Не СтрокаФайл.СодержитОшибки Тогда
			
			МассивФайлов.Добавить(СтрокаФайл.ИмяФайла);
			
			Для каждого СтрокаТаблицыГруппыДоговоровФайла Из СтрокаФайл.ГруппыДоговоров Цикл
			
				СписокДоговоров = СтрокаТаблицыГруппыДоговоровФайла.СписокДоговоров;
				
				Для каждого ЭлементСписка Из СписокДоговоров Цикл
				
					РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементСписка.Значение, "ВидДоговораДоверительногоУправления, КодСчета, НомерДоговора");
					
					СтрокаГруппыДоговоров = ГруппыДоговоров.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаГруппыДоговоров, СтрокаФайл);
					
					СтрокаГруппыДоговоров.ДатаЛВ = СтрокаФайл.Дата;
					СтрокаГруппыДоговоров.ИмяГруппы = СтрокаТаблицыГруппыДоговоровФайла.Представление;
					СтрокаГруппыДоговоров.ВидДоговора = РеквизитыДоговора.ВидДоговораДоверительногоУправления;
					СтрокаГруппыДоговоров.НомерДоговора = РеквизитыДоговора.НомерДоговора;
					СтрокаГруппыДоговоров.КодСчета = РеквизитыДоговора.КодСчета;
					СтрокаГруппыДоговоров.СчетДоверительногоУправления = ЭлементСписка.Значение;
				
				КонецЦикла; 
			
			КонецЦикла; 		
		КонецЕсли; 	
	КонецЦикла;
	
	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Файлы.ИмяФайла КАК ИмяФайла,
		|	Файлы.Дата КАК Дата
		|ПОМЕСТИТЬ _Файлы
		|ИЗ
		|	&Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ИмяФайла В(&МассивФайлов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Файлы.ИмяФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыДоговоров.ИмяФайла КАК ИмяФайла,
		|	ГруппыДоговоров.Клиент КАК Клиент,
		|	ГруппыДоговоров.ВидДоговора КАК ВидДоговора,
		|	ГруппыДоговоров.ИмяГруппы КАК Договоры,
		|	ГруппыДоговоров.НомерДоговора КАК НомерДоговора,
		|	ГруппыДоговоров.КодСчета КАК КодСчета,
		|	ГруппыДоговоров.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ГруппыДоговоров.ДатаЛВ КАК ДатаЛВ
		|ПОМЕСТИТЬ _ГруппыДоговоров
		|ИЗ
		|	&ГруппыДоговоров КАК ГруппыДоговоров
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИмяФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	GroupLimits.Contracts КАК Договоры,
		|	GroupLimits.LimitSizeInCash КАК ЛимитВРублях,
		|	GroupLimits.Name КАК ИмяГруппы,
		|	GroupLimits.ИмяФайла КАК ИмяФайла
		|ПОМЕСТИТЬ _ЛимитыНаГруппы
		|ИЗ
		|	&GroupLimits КАК GroupLimits
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИмяФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	IssuerLimits.Contracts КАК Договоры,
		|	IssuerLimits.IsGuaranteed КАК СГарантией,
		|	IssuerLimits.Guarantor КАК Гарант,
		|	IssuerLimits.ISIN КАК ISIN,
		|	IssuerLimits.InstrumentType КАК ТипИнструмента,
		|	IssuerLimits.IssuerID КАК ИНН,
		|	IssuerLimits.LimitSizeInCash КАК ЛимитВРублях,
		|	IssuerLimits.LimitSizeInPercent КАК ЛимитВПроцентах,
		|	IssuerLimits.LimitSizeInQuantity КАК ЛимитНаКоличество,
		|	IssuerLimits.LimitSizeInYears КАК ЛимитВГодах,
		|	IssuerLimits.LimitType КАК ТипЛимита,
		|	IssuerLimits.MaturityFrom КАК СрокОт,
		|	IssuerLimits.MaturityTo КАК СрокДо,
		|	IssuerLimits.SellOnly КАК ТолькоПродажа,
		|	IssuerLimits.ДатаЗапретаПокупки КАК ДатаЗапретаПокупки,
		|	IssuerLimits.ИмяФайла КАК ИмяФайла,
		|	IssuerLimits.ЦеннаяБумага КАК ЦеннаяБумага,
		|	IssuerLimits.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ЛимитыНаЭмитентов
		|ИЗ
		|	&IssuerLimits КАК IssuerLimits
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИмяФайла,
		|	ЮрФизЛицо,
		|	ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Issuers.ЮрФизЛицо КАК ЮрФизЛицо,
		|	Issuers.ID КАК ИНН
		|ПОМЕСТИТЬ _ЮрЛица
		|ИЗ
		|	&Issuers КАК Issuers
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГруппыЭмитентов.Contracts КАК Договоры,
		|	ГруппыЭмитентов.ИмяГруппы КАК ИмяГруппы,
		|	ГруппыЭмитентов.ИмяФайла КАК ИмяФайла,
		|	ГруппыЭмитентов.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ГруппыЭмитентов
		|ИЗ
		|	&ГруппыЭмитентов КАК ГруппыЭмитентов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИмяФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЮрЛица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыЭмитентов
		|ИЗ
		|	_ЮрЛица КАК _ЮрЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО _ЮрЛица.ЮрФизЛицо = КодыВоВнешнихСистемахСрезПоследних.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект КАК ЦеннаяБумага,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК Код
		|ПОМЕСТИТЬ _КодыАктивов
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Период,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|				И Объект В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						_ЛимитыНаЭмитентов.ЦеннаяБумага
		|					ИЗ
		|						_ЛимитыНаЭмитентов
		|					ГДЕ
		|						_ЛимитыНаЭмитентов.ЦеннаяБумага <> НЕОПРЕДЕЛЕНО)) КАК КодыВоВнешнихСистемахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ГруппыДоговоров.Клиент КАК Клиент,
		|	_ГруппыДоговоров.ВидДоговора КАК ВидДоговора,
		|	_ГруппыДоговоров.Договоры КАК Договоры,
		|	_ГруппыДоговоров.ИмяФайла КАК ИмяФайла,
		|	_ЛимитыНаЭмитентов.ТипЛимита КАК ТипЛимита,
		|	ВЫБОР
		|		КОГДА _ЛимитыНаЭмитентов.ТипЛимита = ""На объем вложений""
		|				И _ЛимитыНаЭмитентов.ТипИнструмента = """"
		|			ТОГДА ""Все активы""
		|		ИНАЧЕ _ЛимитыНаЭмитентов.ТипИнструмента
		|	КОНЕЦ КАК ТипИнструмента,
		|	ЕСТЬNULL(_ГруппыЭмитентов.ИмяГруппы, """") КАК ГруппаЭмитентов,
		|	_ЛимитыНаЭмитентов.ЮрФизЛицо КАК Эмитент,
		|	ЕСТЬNULL(_КодыЭмитентов.Код, """") КАК ЭмитентКод,
		|	_ЛимитыНаЭмитентов.ИНН КАК ЭмитентИНН,
		|	_ЛимитыНаЭмитентов.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_КодыАктивов.Код, """") КАК ЦеннаяБумагаКод,
		|	_ЛимитыНаЭмитентов.ISIN КАК ЦеннаяБумагаISIN,
		|	ВЫРАЗИТЬ(_ЛимитыНаЭмитентов.ЛимитВРублях + _ЛимитыНаЭмитентов.ЛимитВПроцентах + _ЛимитыНаЭмитентов.ЛимитНаКоличество + _ЛимитыНаЭмитентов.ЛимитВГодах КАК ЧИСЛО) КАК РазмерЛимита,
		|	_ЛимитыНаЭмитентов.СрокОт КАК СрокОт,
		|	_ЛимитыНаЭмитентов.СрокДо КАК СрокДо,
		|	_ЛимитыНаЭмитентов.СГарантией КАК СГарантией,
		|	ЕСТЬNULL(_КодыГарантов.ЮрФизЛицо, """") КАК Гарант,
		|	_ЛимитыНаЭмитентов.Гарант КАК ГарантИНН,
		|	ЕСТЬNULL(_КодыГарантов.Код, """") КАК ГарантКод,
		|	_ЛимитыНаЭмитентов.ТолькоПродажа КАК ТолькоПродажа,
		|	ВЫБОР
		|		КОГДА _ЛимитыНаЭмитентов.ТолькоПродажа
		|			ТОГДА _ЛимитыНаЭмитентов.ДатаЗапретаПокупки
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаЗапретаПокупки,
		|	_Файлы.Дата КАК ДатаЛВ
		|ПОМЕСТИТЬ _ИтогЛимитыНаЭмитентов
		|ИЗ
		|	_ЛимитыНаЭмитентов КАК _ЛимитыНаЭмитентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ГруппыДоговоров КАК _ГруппыДоговоров
		|		ПО _ЛимитыНаЭмитентов.ИмяФайла = _ГруппыДоговоров.ИмяФайла
		|			И _ЛимитыНаЭмитентов.Договоры = _ГруппыДоговоров.Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыАктивов КАК _КодыАктивов
		|		ПО _ЛимитыНаЭмитентов.ЦеннаяБумага = _КодыАктивов.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЮрЛица КАК _ЮрЛица
		|			ЛЕВОЕ СОЕДИНЕНИЕ _КодыЭмитентов КАК _КодыГарантов
		|			ПО _ЮрЛица.ЮрФизЛицо = _КодыГарантов.ЮрФизЛицо
		|		ПО _ЛимитыНаЭмитентов.Гарант = _ЮрЛица.ИНН
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КодыЭмитентов КАК _КодыЭмитентов
		|		ПО _ЛимитыНаЭмитентов.ЮрФизЛицо = _КодыЭмитентов.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГруппыЭмитентов КАК _ГруппыЭмитентов
		|		ПО _ЛимитыНаЭмитентов.ИмяФайла = _ГруппыЭмитентов.ИмяФайла
		|			И _ЛимитыНаЭмитентов.Договоры = _ГруппыЭмитентов.Договоры
		|			И _ЛимитыНаЭмитентов.ЮрФизЛицо = _ГруппыЭмитентов.ЮрФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Файлы КАК _Файлы
		|		ПО _ЛимитыНаЭмитентов.ИмяФайла = _Файлы.ИмяФайла
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ГруппыДоговоров.Клиент,
		|	_ГруппыДоговоров.ВидДоговора,
		|	_ГруппыДоговоров.Договоры,
		|	_ГруппыДоговоров.ИмяФайла,
		|	""На объем вложений"",
		|	""Группа эмитентов"",
		|	_ЛимитыНаГруппы.ИмяГруппы,
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	_ЛимитыНаГруппы.ЛимитВРублях,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	ЛОЖЬ,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	_Файлы.Дата
		|ИЗ
		|	_ЛимитыНаГруппы КАК _ЛимитыНаГруппы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ГруппыДоговоров КАК _ГруппыДоговоров
		|		ПО _ЛимитыНаГруппы.ИмяФайла = _ГруппыДоговоров.ИмяФайла
		|			И _ЛимитыНаГруппы.Договоры = _ГруппыДоговоров.Договоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Файлы КАК _Файлы
		|		ПО _ЛимитыНаГруппы.ИмяФайла = _Файлы.ИмяФайла";		
	#КонецОбласти 

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("МассивФайлов", МассивФайлов);
	Запрос.УстановитьПараметр("Файлы", СтруктураТаблиц.Файлы);
	Запрос.УстановитьПараметр("ГруппыДоговоров", ГруппыДоговоров);
	Запрос.УстановитьПараметр("GroupLimits", СтруктураТаблиц.GroupLimits);
	Запрос.УстановитьПараметр("IssuerLimits", СтруктураТаблиц.IssuerLimits);
	Запрос.УстановитьПараметр("Issuers", СтруктураТаблиц.Issuers);
	Запрос.УстановитьПараметр("ГруппыЭмитентов", СтруктураТаблиц.ГруппыЭмитентов);
	
	Запрос.Выполнить();
	
	ТаблицыДляВывода = Новый Массив;
	ТаблицыДляВывода.Добавить(Новый Структура("ИмяТаблицы, Заголовок, Сортировка", "_ИтогЛимитыНаЭмитентов", "Лимиты", "ИмяФайла, Договоры, ТипЛимита, ТипИнструмента, Эмитент, ЦеннаяБумага Автоупорядочивание"));
	ТаблицыДляВывода.Добавить(Новый Структура("ИмяТаблицы, Заголовок, Сортировка", "_ГруппыДоговоров", "Договоры", "ИмяФайла, Договоры"));
	
	Пакет = Новый ПакетОтображаемыхДокументов; 
	Пакет.Заголовок = "Лимитные ведомости";
	
	Для каждого ТекТаблица Из ТаблицыДляВывода Цикл
	
		ТаблицаЗначений = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, ТекТаблица.ИмяТаблицы,,,, ТекТаблица.Сортировка).Выгрузить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка" + ТекТаблица.Заголовок);
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка" + ТекТаблица.Заголовок);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Для каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТаблицы);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		КонецЦикла; 
		
		ЭлементСоставаПакета = Пакет.Состав.Добавить(ПоместитьВоВременноеХранилище(ТабличныйДокумент, Новый УникальныйИдентификатор));
		ЭлементСоставаПакета.Наименование = ТекТаблица.Заголовок;
		
	КонецЦикла; 
	
	Возврат Пакет;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаИзДокументооборота(ПараметрыФайла)

	СписокФайлов = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(ПараметрыФайла.Ссылка);
	
	Файл = Новый Файл(ПараметрыФайла.ИмяФайла);
	Расширение = СтрЗаменить(Файл.Расширение, ".", "");
			
	Для каждого ИнформацияОФайле Из СписокФайлов Цикл	
		
		Если ИнформацияОФайле.Наименование = Файл.ИмяБезРасширения И ИнформацияОФайле.Расширение = Расширение Тогда
		
			ДанныеФайла = РаботаСФайловымХранилищем.ПолучитьФайл(ИнформацияОФайле.ИдентификаторФайла);
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);
			УдалитьИзВременногоХранилища(ДанныеФайла.Адрес);
			
			Возврат Новый Структура("ДвоичныеДанные, ИмяФайла, ПолноеИмяФайла, ДатаСоздания", ДвоичныеДанные, ПараметрыФайла.ИмяФайла, ПараметрыФайла.ИмяФайла, ПараметрыФайла.ДатаСоздания);
		
		КонецЕсли; 
			
	КонецЦикла;

КонецФункции 

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура КомандаПрочитатьФайлыНаСервере(АдресДанных)
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ФайлыДляОбработки = ПолучитьИзВременногоХранилища(АдресДанных);
	
	Для каждого СтрокаТаблицыФайлы Из ЭтаФорма.Файлы Цикл
		Если ЭтоАдресВременногоХранилища(СтрокаТаблицыФайлы.АдресДвоичныхДанныхФайла) Тогда
			УдалитьИзВременногоХранилища(СтрокаТаблицыФайлы.АдресДвоичныхДанныхФайла);
		КонецЕсли;
	КонецЦикла;
	
	ОбъектНаСервере.ПрочитатьФайлы(ФайлыДляОбработки, Истина, ЭтаФорма.УникальныйИдентификатор);
	ОбъектНаСервере.ОповеститьОбОшибках();
	
	ЭтаФорма.Issuers.Загрузить(ОбъектНаСервере.СтруктураТаблиц.Issuers);
	ЭтаФорма.IssuerLimits.Загрузить(ОбъектНаСервере.СтруктураТаблиц.IssuerLimits);
	ЭтаФорма.GroupLimits.Загрузить(ОбъектНаСервере.СтруктураТаблиц.GroupLimits);
	ЭтаФорма.ГруппыЭмитентов.Загрузить(ОбъектНаСервере.СтруктураТаблиц.ГруппыЭмитентов);
	ЭтаФорма.Ошибки.Загрузить(ОбъектНаСервере.СтруктураТаблиц.Ошибки);
	
	ЗначениеВРеквизитФормы(ОбъектНаСервере.СтруктураТаблиц.Файлы, "Файлы");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОшибокПоФайлу(ИмяФайла)

	ЭтаФорма.ОшибкиФайла.Очистить();
	НайденныеСтроки = ЭтаФорма.Ошибки.Выгрузить(Новый Структура("ИмяФайла", ИмяФайла));
	Для каждого СтрокаОшибки Из НайденныеСтроки Цикл
		СтрокиОшибки = ЭтаФорма.ОшибкиФайла.НайтиСтроки(Новый Структура("ОписаниеОшибки", СтрокаОшибки.ОписаниеОшибки));
		Если СтрокиОшибки.Количество() = 0 Тогда
			
			НоваяСтрока = ЭтаФорма.ОшибкиФайла.Добавить();
			НоваяСтрока.ОписаниеОшибки = СтрокаОшибки.ОписаниеОшибки;
			
			Отбор = Новый Структура("НомерСтроки", СтрокаОшибки.ИдентификаторСтроки);
			СтрокиДанных = ЭтаФорма[СтрокаОшибки.Раздел].НайтиСтроки(Отбор);
			СтрокаДанных = СтрокиДанных[0];
			
			Если СтрокаОшибки.Действие = "Создать" Тогда
				НоваяСтрока.Действие = "Создать набор";
				НоваяСтрока.Отбор = СтрокаДанных.Отбор;
				НоваяСтрока.ХэшСуммаУсловийОтбора = СтрокаДанных.ХэшСуммаУсловийОтбора;
			ИначеЕсли СтрокаОшибки.Действие = "ИмпортироватьЦБ" Тогда 
				НоваяСтрока.Действие = "Импортировать";
				НоваяСтрока.СтрокаПоиска = СтрокаДанных.ISIN;
				Если НРег(СтрокаДанных.InstrumentType) = "акции" Тогда
					НоваяСтрока.Группа = Справочники.ГруппыИмпортируемыхОбъектов.Акции;
				Иначе
					НоваяСтрока.Группа = Справочники.ГруппыИмпортируемыхОбъектов.Облигации;
				КонецЕсли; 
			ИначеЕсли СтрокаОшибки.Действие = "ИмпортироватьЮЛ" Тогда 
				НоваяСтрока.Действие = "Импортировать";
				НоваяСтрока.СтрокаПоиска = СтрокаДанных.ID;
				НоваяСтрока.Группа = Справочники.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица;
			КонецЕсли; 
		//Иначе
		//	СтрокаОшибки = СтрокиОшибки[0];
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаборыПоХэшСуммеНаСервере(ВыбраннаяСтрока)

	ТекСтрока = ЭтаФорма.ОшибкиФайла.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборыИнвестиционныхДеклараций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НаборыИнвестиционныхДеклараций КАК НаборыИнвестиционныхДеклараций
		|ГДЕ
		|	НаборыИнвестиционныхДеклараций.ХешСуммаУсловийОтбора = &ХешСуммаУсловийОтбора";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ХешСуммаУсловийОтбора", ТекСтрока.ХэшСуммаУсловийОтбора);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
	 	// обновим статусы ошибок
		СтрокиОшибок = ЭтаФорма.Ошибки.НайтиСтроки(Новый Структура("ХэшСуммаУсловийОтбора", ТекСтрока.ХэшСуммаУсловийОтбора));
		Для каждого Строка Из СтрокиОшибок Цикл
			ЭтаФорма.Ошибки.Удалить(Строка);
		КонецЦикла; 
		ЭтаФорма.ОшибкиФайла.Удалить(ТекСтрока);
		
		// заполним наборы в лимитах 
		СтрокиЛимитов = ЭтаФорма.IssuerLimits.НайтиСтроки(Новый Структура("ХэшСуммаУсловийОтбора", ТекСтрока.ХэшСуммаУсловийОтбора));
		Для каждого Строка Из СтрокиЛимитов Цикл
			Строка.НаборИнвестиционнойДекларации = Выборка.Ссылка;
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ОбновитьСтатусыОшибокФайлов()

	ТаблицаОшибок = ЭтаФорма.Ошибки.Выгрузить(, "ИмяФайла");
	ТаблицаОшибок.Свернуть("ИмяФайла");
	ФайлыСОшибками = ТаблицаОшибок.ВыгрузитьКолонку("ИмяФайла");
	
	СтрокиФайловСОшибками = ЭтаФорма.Файлы.НайтиСтроки(Новый Структура("СодержитОшибки", Истина));
	
	Для каждого СтрокаФайлы Из СтрокиФайловСОшибками Цикл
		
		ГрупповыеЛимиты = ЭтаФорма.GroupLimits.НайтиСтроки(Новый Структура("ИмяФайла", СтрокаФайлы.ИмяФайла));
		ЛимитыЭмитентов = ЭтаФорма.IssuerLimits.НайтиСтроки(Новый Структура("ИмяФайла", СтрокаФайлы.ИмяФайла));
		
		Если ГрупповыеЛимиты.Количество() + ЛимитыЭмитентов.Количество() > 0 Тогда
			СтрокаФайлы.СодержитОшибки = (ФайлыСОшибками.Найти(СтрокаФайлы.ИмяФайла) <> Неопределено);
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервере
Функция СоздатьИНазначитьЛимитныеВедомости(ИдентификаторСтрокиФайлов)
	
	СтрокаТаблицыФайлы = ЭтаФорма.Файлы.НайтиПоИдентификатору(ИдентификаторСтрокиФайлов);
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ОбъектНаСервере.СтруктураТаблиц = Новый Структура;
	ОбъектНаСервере.СтруктураТаблиц.Вставить("Issuers", ЭтаФорма.Issuers.Выгрузить());
	ОбъектНаСервере.СтруктураТаблиц.Вставить("IssuerLimits", ЭтаФорма.IssuerLimits.Выгрузить());
	ОбъектНаСервере.СтруктураТаблиц.Вставить("GroupLimits", ЭтаФорма.GroupLimits.Выгрузить());
	ОбъектНаСервере.СтруктураТаблиц.Вставить("ГруппыЭмитентов", ЭтаФорма.ГруппыЭмитентов.Выгрузить());
	ОбъектНаСервере.СтруктураТаблиц.Вставить("Ошибки", ЭтаФорма.Ошибки.Выгрузить());
	
	Результат = ОбъектНаСервере.СоздатьИНазначитьЛимитныеВедомости(СтрокаТаблицыФайлы, ЭтаФорма.ДопСведение);
	
	ОбъектНаСервере.ОповеститьОбОшибках();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыВыгрузкиВЕГАР(ИдентификаторСтрокиФайлов, ГруппаДоговоров)

	СтрокаФайл = ЭтаФорма.Файлы.НайтиПоИдентификатору(ИдентификаторСтрокиФайлов);
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("Организация", Объект.Организация);
	ПараметрыВыгрузки.Вставить("ИмяФайла", СтрокаФайл.ИмяФайла);
	ПараметрыВыгрузки.Вставить("ГруппаДоговоров", ГруппаДоговоров);
	ПараметрыВыгрузки.Вставить("ЛимитыГрупп", Новый Массив);
	ПараметрыВыгрузки.Вставить("ЛимитыЭмитентов", Новый Массив);
	ПараметрыВыгрузки.Вставить("ГруппыЭмитентов", Новый Массив);
	
	СтрокиГруппДоговоров = СтрокаФайл.ГруппыДоговоров.НайтиСтроки(Новый Структура("Представление", ГруппаДоговоров));
	Если СтрокиГруппДоговоров.Количество() = 1 Тогда
		ПараметрыВыгрузки.Вставить("СписокДоговоров", СтрокиГруппДоговоров[0].СписокДоговоров);
	КонецЕсли;
		
	ЛимитыГрупп = ЭтаФорма.GroupLimits.НайтиСтроки(Новый Структура("ИмяФайла", СтрокаФайл.ИмяФайла));
	Колонки = Новый ФиксированнаяСтруктура("Name, LimitSizeInCash, GroupMember");
	
	Для каждого СтрокаЛимитаГрупп Из ЛимитыГрупп Цикл
	
		ДанныеСтроки = Новый Структура(Колонки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаЛимитаГрупп);
		ПараметрыВыгрузки.ЛимитыГрупп.Добавить(ДанныеСтроки);
	
	КонецЦикла;
	
	ЛимитыЭмитентов = ЭтаФорма.IssuerLimits.НайтиСтроки(Новый Структура("ИмяФайла", СтрокаФайл.ИмяФайла));
	Колонки = Новый ФиксированнаяСтруктура("IssuerID, LimitType, LimitSizeInCash, InstrumentType, Contracts, SellOnly, MaturityTo, LimitSizeInQuantity, ISIN, MaturityFrom, IsGuaranteed, Guarantor, LimitSizeInYears, LimitSizeInPercent, ЮрФизЛицо, ЦеннаяБумага");
	
	Для каждого СтрокаЛимитаЭмитента Из ЛимитыЭмитентов Цикл
	
		ДанныеСтроки = Новый Структура(Колонки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаЛимитаЭмитента);
		ПараметрыВыгрузки.ЛимитыЭмитентов.Добавить(ДанныеСтроки);
		
	КонецЦикла; 
	
	Группы = ЭтаФорма.ГруппыЭмитентов.НайтиСтроки(Новый Структура("ИмяФайла", СтрокаФайл.ИмяФайла));
	Колонки = Новый ФиксированнаяСтруктура("IssuerID, ЮрФизЛицо, ИмяГруппы");
	
	Для каждого СтрокаГруппы Из Группы Цикл
	
		ДанныеСтроки = Новый Структура(Колонки);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаГруппы);
		ПараметрыВыгрузки.ГруппыЭмитентов.Добавить(ДанныеСтроки);
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыВыгрузки, ЭтаФорма.УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура ИзменитьФлажки(Значение)

	Для каждого СтрокаТаблицыФайлы Из ЭтаФорма.Файлы Цикл
		СтрокаТаблицыФайлы.Загрузить = Значение;
	КонецЦикла;

КонецПроцедуры 

#КонецОбласти
